zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/MIMXRT2663_COMMON.h
  AUDIO_PDM_EVENT_IRQn         = 262,              /**< AUDIO MICDIL Filter Results Available (Fifo) Interrupt */
  AUDIO_PDM_ERROR_IRQn         = 263,              /**< AUDIO MICDIL Error interrupt */
  AUDIO_SPDIF_IRQn             = 270,              /**< AUDIO SPDIF interrupt */
  AUDIO_EDMA3_CH0_IRQn         = 271,              /**< AUDIO EDMA3: Channel 0 interrupt */
  AUDIO_EDMA3_CH1_IRQn         = 272,              /**< AUDIO EDMA3: Channel 1 interrupt */
  AUDIO_EDMA3_CH2_IRQn         = 273,              /**< AUDIO EDMA3: Channel 2 interrupt */
  AUDIO_EDMA3_CH3_IRQn         = 274,              /**< AUDIO EDMA3: Channel 3 interrupt */
  AUDIO_EDMA3_CH4_IRQn         = 275,              /**< AUDIO EDMA3: Channel 4 interrupt */
  AUDIO_EDMA3_CH5_IRQn         = 276,              /**< AUDIO EDMA3: Channel 5 interrupt */
  AUDIO_EDMA3_CH6_IRQn         = 277,              /**< AUDIO EDMA3: Channel 6 interrupt */
  AUDIO_EDMA3_CH7_IRQn         = 278,              /**< AUDIO EDMA3: Channel 7 interrupt */
  AUDIO_ASRC_IRQn              = 288,              /**< AUDIO ASRC interrupt */
  AUDIO_FREQME_IRQn            = 289,              /**< AUDIO FREQME interrupt */
  COMM_TRDC_IRQn               = 295,              /**< COMM TRDC interrupt */
  COMM_ENET_QOS_IRQn           = 296,              /**< COMM ENET_QOS interrupt */
  COMM_ENET_QOS_TX_IRQn        = 297,              /**< ENET_QOS: Per Channel Transmit Interrupt Signal To Host System */
  COMM_ENET_QOS_RX_IRQn        = 298,              /**< ENET_QOS: Per Channel Receive Interrupt Signal To Host System */
  COMM_ENET_TX_IRQn            = 299,              /**< COMM ENET TX interrupt */
  COMM_ENET_RX_IRQn            = 300,              /**< COMM ENET RX interrupt */
  COMM_ENET_OTHER_IRQn         = 301,              /**< ENET_1G_MAC: ETH OTHER_INT0_17 */
  COMM_ENET_1588_IRQn          = 302,              /**< ENET_1G_MAC: IEEE-1588 Timer Interrupt */
  COMM_FLEXSPI_SLV_IRQn        = 303,              /**< COMM FlexSPI follower interrupt */
  COMM_USB0_IRQn               = 304,              /**< COMM USBHS interrupt */
  COMM_USBPHY_IRQn             = 305,              /**< COMM USBPHY interrupt */
  COMM_USB1_IRQn               = 306,              /**< COMM USBFS interrupt */
  COMM_USDHC0_IRQn             = 307,              /**< COMM USDHC0 interrupt */
  COMM_USDHC1_IRQn             = 308,              /**< COMM USDHC1 interrupt */
  COMM_TENBASET_PHY0_IRQn      = 310,              /**< XENO_PHY0:Functional IRQ1 interrupt request  */
  COMM_TENBASET_PHY1_IRQn      = 312,              /**< XENO_PHY1:Functional IRQ1 interrupt request  */
  COMM_FREQME_IRQn             = 314,              /**< COMM FREQME interrupt */
  MEDIA_TRDC_IRQn              = 315,              /**< MEDIA TRDC interrupt */
  MEDIA_DCIF_CH0_IRQn          = 317,              /**< MEDIA DCIF channel 0 interrupt */
  MEDIA_DCIF_CH1_IRQn          = 318,              /**< MEDIA DCIF channel 1 interrupt */
  MEDIA_DCIF_CH2_IRQn          = 319,              /**< MEDIA DCIF channel 2 interrupt */
  MEDIA_DCIF_CH3_IRQn          = 320,              /**< MEDIA DCIF channel 3 interrupt */
  MEDIA_DCIF_CH4_IRQn          = 321,              /**< MEDIA DCIF channel 4 interrupt */
  MEDIA_DCIF_CH5_IRQn          = 322,              /**< MEDIA DCIF channel 5 interrupt */
  MEDIA_DCIF_CH6_IRQn          = 323,              /**< MEDIA DCIF channel 6 interrupt */
  MEDIA_DCIF_CH7_IRQn          = 324,              /**< MEDIA DCIF channel 7 interrupt */
  MEDIA_DCIF_CH8_IRQn          = 325,              /**< MEDIA DCIF channel 8 interrupt */
  MEDIA_CSI_IRQn               = 326,              /**< CSI:CSI Interrupt Request */
  MEDIA_REFORMATTER_IRQn       = 327,              /**< MEDIA REFORMATTER interrupt */
  MEDIA_ISI_IRQn               = 328,              /**< MEDIA ISI interrupt */
  MEDIA_TINGPU_IRQn            = 329,              /**< MEDIA TINGPU interrupt */
  MEDIA_JPEGDEC_IRQn           = 330,              /**< MEDIA JPEGDEC interrupt */
  MEDIA_MIPI_CSI_IRQn          = 331,              /**< MIPI_CSI: Interrupt Request */
  MEDIA_MIPI_DSI_IRQn          = 332,              /**< MIPI_DSI: Interrupt Request */
  MEDIA_FREQME_IRQn            = 333               /**< MEDIA FREQME interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M85 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M85 Core Configuration
 * @{
 */

#define __MPU_PRESENT                  1         /**< Defines if an MPU is present or not */
#define __ICACHE_PRESENT               1         /**< Defines if an ICACHE is present or not */
#define __DCACHE_PRESENT               1         /**< Defines if an DCACHE is present or not */
#define __NVIC_PRIO_BITS               3         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */
#define __DSP_PRESENT                  1         /**< Defines if Armv8-M Mainline core supports DSP instructions */
#define __SAUREGION_PRESENT            1         /**< Defines if an SAU is present or not */

#include "core_cm85.h"                 /* Core Peripheral Access Layer */
#include "system_MIMXRT2663.h"         /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


#ifndef MIMXRT2663_SERIES
#define MIMXRT2663_SERIES
#endif
/* CPU specific feature definitions */
#include "MIMXRT2663_features.h"

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup asrc_clock_source
 * @{
 */

