zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/MIMXRT2663_COMMON.h
typedef enum _xbar_output_signal
{
    kAUDIO__XBAR_OutputCommFreqmeInput = 0|0x10000U, /**< AUDIO_XBAR_OUT0 output assigned to COMM_FREQME_INPUT */
    kAUDIO__XBAR_OutputRESERVED1    = 1|0x10000U,  /**< AUDIO_XBAR_OUT1 output is reserved. */
    kAUDIO__XBAR_OutputRESERVED2    = 2|0x10000U,  /**< AUDIO_XBAR_OUT2 output is reserved. */
    kAUDIO__XBAR_OutputRESERVED3    = 3|0x10000U,  /**< AUDIO_XBAR_OUT3 output is reserved. */
    kAUDIO__XBAR_OutputRESERVED4    = 4|0x10000U,  /**< AUDIO_XBAR_OUT4 output is reserved. */
    kAUDIO__XBAR_OutputHspXbar0In74Xbar1In42 = 5|0x10000U, /**< AUDIO_XBAR_OUT5 output assigned to HSP_XBAR0_IN74_XBAR1_IN42 */
    kAUDIO__XBAR_OutputHspXbar0In75Xbar1In43 = 6|0x10000U, /**< AUDIO_XBAR_OUT6 output assigned to HSP_XBAR0_IN75_XBAR1_IN43 */
    kAUDIO__XBAR_OutputHspXbar0In76Xbar1In44 = 7|0x10000U, /**< AUDIO_XBAR_OUT7 output assigned to HSP_XBAR0_IN76_XBAR1_IN44 */
    kAUDIO__XBAR_OutputHspXbar0In77Xbar1In45 = 8|0x10000U, /**< AUDIO_XBAR_OUT8 output assigned to HSP_XBAR0_IN77_XBAR1_IN45 */
    kAUDIO__XBAR_OutputRESERVED9    = 9|0x10000U,  /**< AUDIO_XBAR_OUT9 output is reserved. */
    kAUDIO__XBAR_OutputRESERVED10   = 10|0x10000U, /**< AUDIO_XBAR_OUT10 output is reserved. */
    kHSP__XBAR_0_OutputHspXbar0Out0 = 0|0x20000U,  /**< HSP_XBAR_0_OUT0 output assigned to HSP_XBAR0_OUT0 */
    kHSP__XBAR_0_OutputHspXbar0Out1 = 1|0x20000U,  /**< HSP_XBAR_0_OUT1 output assigned to HSP_XBAR0_OUT1 */
    kHSP__XBAR_0_OutputHspXbar0Out2 = 2|0x20000U,  /**< HSP_XBAR_0_OUT2 output assigned to HSP_XBAR0_OUT2 */
    kHSP__XBAR_0_OutputHspXbar0Out3 = 3|0x20000U,  /**< HSP_XBAR_0_OUT3 output assigned to HSP_XBAR0_OUT3 */
    kHSP__XBAR_0_OutputHspXbar0Out4 = 4|0x20000U,  /**< HSP_XBAR_0_OUT4 output assigned to HSP_XBAR0_OUT4 */
    kHSP__XBAR_0_OutputHspXbar0Out5 = 5|0x20000U,  /**< HSP_XBAR_0_OUT5 output assigned to HSP_XBAR0_OUT5 */
    kHSP__XBAR_0_OutputHspXbar0Out6 = 6|0x20000U,  /**< HSP_XBAR_0_OUT6 output assigned to HSP_XBAR0_OUT6 */
    kHSP__XBAR_0_OutputHspXbar0Out7 = 7|0x20000U,  /**< HSP_XBAR_0_OUT7 output assigned to HSP_XBAR0_OUT7 */
    kHSP__XBAR_0_OutputMainFreqmeInput = 8|0x20000U, /**< HSP_XBAR_0_OUT8 output assigned to MAIN_FREQME_INPUT */
    kHSP__XBAR_0_OutputSysconFreqmeInput = 9|0x20000U, /**< HSP_XBAR_0_OUT9 output assigned to SYSCON_FREQME_INPUT */
    kHSP__XBAR_0_OutputHspAdc01Ch01TrigIn0 = 10|0x20000U, /**< HSP_XBAR_0_OUT10 output assigned to HSP_ADC0_1_CH0_1_TRIG_IN0 */
    kHSP__XBAR_0_OutputHspAdc01Ch01TrigIn1 = 11|0x20000U, /**< HSP_XBAR_0_OUT11 output assigned to HSP_ADC0_1_CH0_1_TRIG_IN1 */
    kHSP__XBAR_0_OutputHspAdc01Ch01TrigIn2 = 12|0x20000U, /**< HSP_XBAR_0_OUT12 output assigned to HSP_ADC0_1_CH0_1_TRIG_IN2 */
    kHSP__XBAR_0_OutputHspAdc01Ch01TrigIn3 = 13|0x20000U, /**< HSP_XBAR_0_OUT13 output assigned to HSP_ADC0_1_CH0_1_TRIG_IN3 */
    kHSP__XBAR_0_OutputHspAdc01Ch01TrigIn4 = 14|0x20000U, /**< HSP_XBAR_0_OUT14 output assigned to HSP_ADC0_1_CH0_1_TRIG_IN4 */
    kHSP__XBAR_0_OutputHspAdc01Ch01TrigIn5 = 15|0x20000U, /**< HSP_XBAR_0_OUT15 output assigned to HSP_ADC0_1_CH0_1_TRIG_IN5 */
    kHSP__XBAR_0_OutputHspAdc01Ch01TrigIn6 = 16|0x20000U, /**< HSP_XBAR_0_OUT16 output assigned to HSP_ADC0_1_CH0_1_TRIG_IN6 */
    kHSP__XBAR_0_OutputHspAdc01Ch01TrigIn7 = 17|0x20000U, /**< HSP_XBAR_0_OUT17 output assigned to HSP_ADC0_1_CH0_1_TRIG_IN7 */
    kHSP__XBAR_0_OutputHspAdc10Ch01TrigIn0 = 18|0x20000U, /**< HSP_XBAR_0_OUT18 output assigned to HSP_ADC1_0_CH0_1_TRIG_IN0 */
    kHSP__XBAR_0_OutputHspAdc10Ch01TrigIn1 = 19|0x20000U, /**< HSP_XBAR_0_OUT19 output assigned to HSP_ADC1_0_CH0_1_TRIG_IN1 */
    kHSP__XBAR_0_OutputHspAdc10Ch01TrigIn2 = 20|0x20000U, /**< HSP_XBAR_0_OUT20 output assigned to HSP_ADC1_0_CH0_1_TRIG_IN2 */
    kHSP__XBAR_0_OutputHspAdc10Ch01TrigIn3 = 21|0x20000U, /**< HSP_XBAR_0_OUT21 output assigned to HSP_ADC1_0_CH0_1_TRIG_IN3 */
    kHSP__XBAR_0_OutputHspAdc10Ch01TrigIn4 = 22|0x20000U, /**< HSP_XBAR_0_OUT22 output assigned to HSP_ADC1_0_CH0_1_TRIG_IN4 */
    kHSP__XBAR_0_OutputHspAdc10Ch01TrigIn5 = 23|0x20000U, /**< HSP_XBAR_0_OUT23 output assigned to HSP_ADC1_0_CH0_1_TRIG_IN5 */
    kHSP__XBAR_0_OutputHspAdc10Ch01TrigIn6 = 24|0x20000U, /**< HSP_XBAR_0_OUT24 output assigned to HSP_ADC1_0_CH0_1_TRIG_IN6 */
    kHSP__XBAR_0_OutputHspAdc10Ch01TrigIn7 = 25|0x20000U, /**< HSP_XBAR_0_OUT25 output assigned to HSP_ADC1_0_CH0_1_TRIG_IN7 */
    kHSP__XBAR_0_OutputHspDacTrigIn = 26|0x20000U, /**< HSP_XBAR_0_OUT26 output assigned to HSP_DAC_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpit0TrigIn0 = 27|0x20000U, /**< HSP_XBAR_0_OUT27 output assigned to HSP_LPIT0_TRIG_IN0 */
    kHSP__XBAR_0_OutputHspLpit0TrigIn1 = 28|0x20000U, /**< HSP_XBAR_0_OUT28 output assigned to HSP_LPIT0_TRIG_IN1 */
    kHSP__XBAR_0_OutputHspLpit0TrigIn2 = 29|0x20000U, /**< HSP_XBAR_0_OUT29 output assigned to HSP_LPIT0_TRIG_IN2 */
    kHSP__XBAR_0_OutputHspLpit0TrigIn3 = 30|0x20000U, /**< HSP_XBAR_0_OUT30 output assigned to HSP_LPIT0_TRIG_IN3 */
    kHSP__XBAR_0_OutputHspLpit1TrigIn0 = 31|0x20000U, /**< HSP_XBAR_0_OUT31 output assigned to HSP_LPIT1_TRIG_IN0 */
    kHSP__XBAR_0_OutputHspLpit1TrigIn1 = 32|0x20000U, /**< HSP_XBAR_0_OUT32 output assigned to HSP_LPIT1_TRIG_IN1 */
    kHSP__XBAR_0_OutputHspLpit1TrigIn2 = 33|0x20000U, /**< HSP_XBAR_0_OUT33 output assigned to HSP_LPIT1_TRIG_IN2 */
    kHSP__XBAR_0_OutputHspLpit1TrigIn3 = 34|0x20000U, /**< HSP_XBAR_0_OUT34 output assigned to HSP_LPIT1_TRIG_IN3 */
    kHSP__XBAR_0_OutputHspFlexpwm0FaultIn0 = 35|0x20000U, /**< HSP_XBAR_0_OUT35 output assigned to HSP_FLEXPWM0_FAULT_IN0 */
    kHSP__XBAR_0_OutputHspFlexpwm0FaultIn1 = 36|0x20000U, /**< HSP_XBAR_0_OUT36 output assigned to HSP_FLEXPWM0_FAULT_IN1 */
    kHSP__XBAR_0_OutputHspFlexpwm0FaultIn2 = 37|0x20000U, /**< HSP_XBAR_0_OUT37 output assigned to HSP_FLEXPWM0_FAULT_IN2 */
    kHSP__XBAR_0_OutputHspFlexpwm0FaultIn3 = 38|0x20000U, /**< HSP_XBAR_0_OUT38 output assigned to HSP_FLEXPWM0_FAULT_IN3 */
    kHSP__XBAR_0_OutputHspFlexpwm0ExtClk = 39|0x20000U, /**< HSP_XBAR_0_OUT39 output assigned to HSP_FLEXPWM0_EXT_CLK */
    kHSP__XBAR_0_OutputHspFlexpwm0ExtForce = 40|0x20000U, /**< HSP_XBAR_0_OUT40 output assigned to HSP_FLEXPWM0_EXT_FORCE */
    kHSP__XBAR_0_OutputHspFlexpwm0ExtSync0 = 41|0x20000U, /**< HSP_XBAR_0_OUT41 output assigned to HSP_FLEXPWM0_EXT_SYNC0 */
    kHSP__XBAR_0_OutputHspFlexpwm0ExtSync1 = 42|0x20000U, /**< HSP_XBAR_0_OUT42 output assigned to HSP_FLEXPWM0_EXT_SYNC1 */
    kHSP__XBAR_0_OutputHspFlexpwm0ExtSync2 = 43|0x20000U, /**< HSP_XBAR_0_OUT43 output assigned to HSP_FLEXPWM0_EXT_SYNC2 */
    kHSP__XBAR_0_OutputHspFlexpwm0ExtSync3 = 44|0x20000U, /**< HSP_XBAR_0_OUT44 output assigned to HSP_FLEXPWM0_EXT_SYNC3 */
    kHSP__XBAR_0_OutputHspFlexpwm0Exta0 = 45|0x20000U, /**< HSP_XBAR_0_OUT45 output assigned to HSP_FLEXPWM0_EXTA0 */
    kHSP__XBAR_0_OutputHspFlexpwm0Exta1 = 46|0x20000U, /**< HSP_XBAR_0_OUT46 output assigned to HSP_FLEXPWM0_EXTA1 */
    kHSP__XBAR_0_OutputHspFlexpwm0Exta2 = 47|0x20000U, /**< HSP_XBAR_0_OUT47 output assigned to HSP_FLEXPWM0_EXTA2 */
    kHSP__XBAR_0_OutputHspFlexpwm0Exta3 = 48|0x20000U, /**< HSP_XBAR_0_OUT48 output assigned to HSP_FLEXPWM0_EXTA3 */
    kHSP__XBAR_0_OutputHspFlexpwm1FaultIn0 = 49|0x20000U, /**< HSP_XBAR_0_OUT49 output assigned to HSP_FLEXPWM1_FAULT_IN0 */
    kHSP__XBAR_0_OutputHspFlexpwm1FaultIn1 = 50|0x20000U, /**< HSP_XBAR_0_OUT50 output assigned to HSP_FLEXPWM1_FAULT_IN1 */
    kHSP__XBAR_0_OutputHspFlexpwm1FaultIn2 = 51|0x20000U, /**< HSP_XBAR_0_OUT51 output assigned to HSP_FLEXPWM1_FAULT_IN2 */
    kHSP__XBAR_0_OutputHspFlexpwm1FaultIn3 = 52|0x20000U, /**< HSP_XBAR_0_OUT52 output assigned to HSP_FLEXPWM1_FAULT_IN3 */
    kHSP__XBAR_0_OutputHspFlexpwm1ExtClk = 53|0x20000U, /**< HSP_XBAR_0_OUT53 output assigned to HSP_FLEXPWM1_EXT_CLK */
    kHSP__XBAR_0_OutputHspFlexpwm1ExtForce = 54|0x20000U, /**< HSP_XBAR_0_OUT54 output assigned to HSP_FLEXPWM1_EXT_FORCE */
    kHSP__XBAR_0_OutputHspFlexpwm1ExtSync0 = 55|0x20000U, /**< HSP_XBAR_0_OUT55 output assigned to HSP_FLEXPWM1_EXT_SYNC0 */
    kHSP__XBAR_0_OutputHspFlexpwm1ExtSync1 = 56|0x20000U, /**< HSP_XBAR_0_OUT56 output assigned to HSP_FLEXPWM1_EXT_SYNC1 */
    kHSP__XBAR_0_OutputHspFlexpwm1ExtSync2 = 57|0x20000U, /**< HSP_XBAR_0_OUT57 output assigned to HSP_FLEXPWM1_EXT_SYNC2 */
    kHSP__XBAR_0_OutputHspFlexpwm1ExtSync3 = 58|0x20000U, /**< HSP_XBAR_0_OUT58 output assigned to HSP_FLEXPWM1_EXT_SYNC3 */
    kHSP__XBAR_0_OutputHspFlexpwm1Exta0 = 59|0x20000U, /**< HSP_XBAR_0_OUT59 output assigned to HSP_FLEXPWM1_EXTA0 */
    kHSP__XBAR_0_OutputHspFlexpwm1Exta1 = 60|0x20000U, /**< HSP_XBAR_0_OUT60 output assigned to HSP_FLEXPWM1_EXTA1 */
    kHSP__XBAR_0_OutputHspFlexpwm1Exta2 = 61|0x20000U, /**< HSP_XBAR_0_OUT61 output assigned to HSP_FLEXPWM1_EXTA2 */
    kHSP__XBAR_0_OutputHspFlexpwm1Exta3 = 62|0x20000U, /**< HSP_XBAR_0_OUT62 output assigned to HSP_FLEXPWM1_EXTA3 */
    kHSP__XBAR_0_OutputHspFlexpwm2FaultIn0 = 63|0x20000U, /**< HSP_XBAR_0_OUT63 output assigned to HSP_FLEXPWM2_FAULT_IN0 */
    kHSP__XBAR_0_OutputHspFlexpwm2FaultIn1 = 64|0x20000U, /**< HSP_XBAR_0_OUT64 output assigned to HSP_FLEXPWM2_FAULT_IN1 */
    kHSP__XBAR_0_OutputHspFlexpwm2FaultIn2 = 65|0x20000U, /**< HSP_XBAR_0_OUT65 output assigned to HSP_FLEXPWM2_FAULT_IN2 */
    kHSP__XBAR_0_OutputHspFlexpwm2FaultIn3 = 66|0x20000U, /**< HSP_XBAR_0_OUT66 output assigned to HSP_FLEXPWM2_FAULT_IN3 */
    kHSP__XBAR_0_OutputHspFlexpwm2ExtClk = 67|0x20000U, /**< HSP_XBAR_0_OUT67 output assigned to HSP_FLEXPWM2_EXT_CLK */
    kHSP__XBAR_0_OutputHspFlexpwm2ExtForce = 68|0x20000U, /**< HSP_XBAR_0_OUT68 output assigned to HSP_FLEXPWM2_EXT_FORCE */
    kHSP__XBAR_0_OutputHspFlexpwm2ExtSync0 = 69|0x20000U, /**< HSP_XBAR_0_OUT69 output assigned to HSP_FLEXPWM2_EXT_SYNC0 */
    kHSP__XBAR_0_OutputHspFlexpwm2ExtSync1 = 70|0x20000U, /**< HSP_XBAR_0_OUT70 output assigned to HSP_FLEXPWM2_EXT_SYNC1 */
    kHSP__XBAR_0_OutputHspFlexpwm2ExtSync2 = 71|0x20000U, /**< HSP_XBAR_0_OUT71 output assigned to HSP_FLEXPWM2_EXT_SYNC2 */
    kHSP__XBAR_0_OutputHspFlexpwm2ExtSync3 = 72|0x20000U, /**< HSP_XBAR_0_OUT72 output assigned to HSP_FLEXPWM2_EXT_SYNC3 */
    kHSP__XBAR_0_OutputHspFlexpwm2Exta0 = 73|0x20000U, /**< HSP_XBAR_0_OUT73 output assigned to HSP_FLEXPWM2_EXTA0 */
    kHSP__XBAR_0_OutputHspFlexpwm2Exta1 = 74|0x20000U, /**< HSP_XBAR_0_OUT74 output assigned to HSP_FLEXPWM2_EXTA1 */
    kHSP__XBAR_0_OutputHspFlexpwm2Exta2 = 75|0x20000U, /**< HSP_XBAR_0_OUT75 output assigned to HSP_FLEXPWM2_EXTA2 */
    kHSP__XBAR_0_OutputHspFlexpwm2Exta3 = 76|0x20000U, /**< HSP_XBAR_0_OUT76 output assigned to HSP_FLEXPWM2_EXTA3 */
    kHSP__XBAR_0_OutputHspFlexpwm3FaultIn0 = 77|0x20000U, /**< HSP_XBAR_0_OUT77 output assigned to HSP_FLEXPWM3_FAULT_IN0 */
    kHSP__XBAR_0_OutputHspFlexpwm3FaultIn1 = 78|0x20000U, /**< HSP_XBAR_0_OUT78 output assigned to HSP_FLEXPWM3_FAULT_IN1 */
    kHSP__XBAR_0_OutputHspFlexpwm3FaultIn2 = 79|0x20000U, /**< HSP_XBAR_0_OUT79 output assigned to HSP_FLEXPWM3_FAULT_IN2 */
    kHSP__XBAR_0_OutputHspFlexpwm3FaultIn3 = 80|0x20000U, /**< HSP_XBAR_0_OUT80 output assigned to HSP_FLEXPWM3_FAULT_IN3 */
    kHSP__XBAR_0_OutputHspFlexpwm3ExtClk = 81|0x20000U, /**< HSP_XBAR_0_OUT81 output assigned to HSP_FLEXPWM3_EXT_CLK */
    kHSP__XBAR_0_OutputHspFlexpwm3ExtForce = 82|0x20000U, /**< HSP_XBAR_0_OUT82 output assigned to HSP_FLEXPWM3_EXT_FORCE */
    kHSP__XBAR_0_OutputHspFlexpwm3ExtSync0 = 83|0x20000U, /**< HSP_XBAR_0_OUT83 output assigned to HSP_FLEXPWM3_EXT_SYNC0 */
    kHSP__XBAR_0_OutputHspFlexpwm3ExtSync1 = 84|0x20000U, /**< HSP_XBAR_0_OUT84 output assigned to HSP_FLEXPWM3_EXT_SYNC1 */
    kHSP__XBAR_0_OutputHspFlexpwm3ExtSync2 = 85|0x20000U, /**< HSP_XBAR_0_OUT85 output assigned to HSP_FLEXPWM3_EXT_SYNC2 */
    kHSP__XBAR_0_OutputHspFlexpwm3ExtSync3 = 86|0x20000U, /**< HSP_XBAR_0_OUT86 output assigned to HSP_FLEXPWM3_EXT_SYNC3 */
    kHSP__XBAR_0_OutputHspFlexpwm3Exta0 = 87|0x20000U, /**< HSP_XBAR_0_OUT87 output assigned to HSP_FLEXPWM3_EXTA0 */
    kHSP__XBAR_0_OutputHspFlexpwm3Exta1 = 88|0x20000U, /**< HSP_XBAR_0_OUT88 output assigned to HSP_FLEXPWM3_EXTA1 */
    kHSP__XBAR_0_OutputHspFlexpwm3Exta2 = 89|0x20000U, /**< HSP_XBAR_0_OUT89 output assigned to HSP_FLEXPWM3_EXTA2 */
    kHSP__XBAR_0_OutputHspFlexpwm3Exta3 = 90|0x20000U, /**< HSP_XBAR_0_OUT90 output assigned to HSP_FLEXPWM3_EXTA3 */
    kHSP__XBAR_0_OutputHspFlexpwm0123FaultIn4 = 91|0x20000U, /**< HSP_XBAR_0_OUT91 output assigned to HSP_FLEXPWM0_1_2_3_FAULT_IN4 */
    kHSP__XBAR_0_OutputHspFlexpwm0123FaultIn5 = 92|0x20000U, /**< HSP_XBAR_0_OUT92 output assigned to HSP_FLEXPWM0_1_2_3_FAULT_IN5 */
    kHSP__XBAR_0_OutputHspFlexpwm0123FaultIn6 = 93|0x20000U, /**< HSP_XBAR_0_OUT93 output assigned to HSP_FLEXPWM0_1_2_3_FAULT_IN6 */
    kHSP__XBAR_0_OutputHspFlexpwm0123FaultIn7 = 94|0x20000U, /**< HSP_XBAR_0_OUT94 output assigned to HSP_FLEXPWM0_1_2_3_FAULT_IN7 */
    kHSP__XBAR_0_OutputHspQuadtpm0TrigIn0 = 95|0x20000U, /**< HSP_XBAR_0_OUT95 output assigned to HSP_QUADTPM0_TRIG_IN0 */
    kHSP__XBAR_0_OutputHspQuadtpm0TrigIn1 = 96|0x20000U, /**< HSP_XBAR_0_OUT96 output assigned to HSP_QUADTPM0_TRIG_IN1 */
    kHSP__XBAR_0_OutputHspQuadtpm0TrigIn2 = 97|0x20000U, /**< HSP_XBAR_0_OUT97 output assigned to HSP_QUADTPM0_TRIG_IN2 */
    kHSP__XBAR_0_OutputHspQuadtpm0TrigIn3 = 98|0x20000U, /**< HSP_XBAR_0_OUT98 output assigned to HSP_QUADTPM0_TRIG_IN3 */
    kHSP__XBAR_0_OutputRESERVED99   = 99|0x20000U, /**< HSP_XBAR_0_OUT99 output is reserved. */
    kHSP__XBAR_0_OutputRESERVED100  = 100|0x20000U, /**< HSP_XBAR_0_OUT100 output is reserved. */
    kHSP__XBAR_0_OutputRESERVED101  = 101|0x20000U, /**< HSP_XBAR_0_OUT101 output is reserved. */
    kHSP__XBAR_0_OutputRESERVED102  = 102|0x20000U, /**< HSP_XBAR_0_OUT102 output is reserved. */
    kHSP__XBAR_0_OutputRESERVED103  = 103|0x20000U, /**< HSP_XBAR_0_OUT103 output is reserved. */
    kHSP__XBAR_0_OutputRESERVED104  = 104|0x20000U, /**< HSP_XBAR_0_OUT104 output is reserved. */
    kHSP__XBAR_0_OutputRESERVED105  = 105|0x20000U, /**< HSP_XBAR_0_OUT105 output is reserved. */
    kHSP__XBAR_0_OutputRESERVED106  = 106|0x20000U, /**< HSP_XBAR_0_OUT106 output is reserved. */
    kHSP__XBAR_0_OutputHspQtmr0In0  = 107|0x20000U, /**< HSP_XBAR_0_OUT107 output assigned to HSP_QTMR0_IN0 */
    kHSP__XBAR_0_OutputHspQtmr0In1  = 108|0x20000U, /**< HSP_XBAR_0_OUT108 output assigned to HSP_QTMR0_IN1 */
    kHSP__XBAR_0_OutputHspQtmr0In2  = 109|0x20000U, /**< HSP_XBAR_0_OUT109 output assigned to HSP_QTMR0_IN2 */
    kHSP__XBAR_0_OutputHspQtmr0In3  = 110|0x20000U, /**< HSP_XBAR_0_OUT110 output assigned to HSP_QTMR0_IN3 */
    kHSP__XBAR_0_OutputHspQtmr1In0  = 111|0x20000U, /**< HSP_XBAR_0_OUT111 output assigned to HSP_QTMR1_IN0 */
    kHSP__XBAR_0_OutputHspQtmr1In1  = 112|0x20000U, /**< HSP_XBAR_0_OUT112 output assigned to HSP_QTMR1_IN1 */
    kHSP__XBAR_0_OutputHspQtmr1In2  = 113|0x20000U, /**< HSP_XBAR_0_OUT113 output assigned to HSP_QTMR1_IN2 */
    kHSP__XBAR_0_OutputHspQtmr1In3  = 114|0x20000U, /**< HSP_XBAR_0_OUT114 output assigned to HSP_QTMR1_IN3 */
    kHSP__XBAR_0_OutputHspQtmr2In0  = 115|0x20000U, /**< HSP_XBAR_0_OUT115 output assigned to HSP_QTMR2_IN0 */
    kHSP__XBAR_0_OutputHspQtmr2In1  = 116|0x20000U, /**< HSP_XBAR_0_OUT116 output assigned to HSP_QTMR2_IN1 */
    kHSP__XBAR_0_OutputHspQtmr2In2  = 117|0x20000U, /**< HSP_XBAR_0_OUT117 output assigned to HSP_QTMR2_IN2 */
    kHSP__XBAR_0_OutputHspQtmr2In3  = 118|0x20000U, /**< HSP_XBAR_0_OUT118 output assigned to HSP_QTMR2_IN3 */
    kHSP__XBAR_0_OutputHspQtmr3In0  = 119|0x20000U, /**< HSP_XBAR_0_OUT119 output assigned to HSP_QTMR3_IN0 */
    kHSP__XBAR_0_OutputHspQtmr3In1  = 120|0x20000U, /**< HSP_XBAR_0_OUT120 output assigned to HSP_QTMR3_IN1 */
    kHSP__XBAR_0_OutputHspQtmr3In2  = 121|0x20000U, /**< HSP_XBAR_0_OUT121 output assigned to HSP_QTMR3_IN2 */
    kHSP__XBAR_0_OutputHspQtmr3In3  = 122|0x20000U, /**< HSP_XBAR_0_OUT122 output assigned to HSP_QTMR3_IN3 */
    kHSP__XBAR_0_OutputHspEqdc0PhaseAIn = 123|0x20000U, /**< HSP_XBAR_0_OUT123 output assigned to HSP_EQDC0_PHASE_A_IN */
    kHSP__XBAR_0_OutputHspEqdc0PhaseBIn = 124|0x20000U, /**< HSP_XBAR_0_OUT124 output assigned to HSP_EQDC0_PHASE_B_IN */
    kHSP__XBAR_0_OutputHspEqdc0IndexIn = 125|0x20000U, /**< HSP_XBAR_0_OUT125 output assigned to HSP_EQDC0_INDEX_IN */
    kHSP__XBAR_0_OutputHspEqdc0HomeIn = 126|0x20000U, /**< HSP_XBAR_0_OUT126 output assigned to HSP_EQDC0_HOME_IN */
    kHSP__XBAR_0_OutputHspEqdc0TrigIn = 127|0x20000U, /**< HSP_XBAR_0_OUT127 output assigned to HSP_EQDC0_TRIG_IN */
    kHSP__XBAR_0_OutputHspEqdc0Capture1 = 128|0x20000U, /**< HSP_XBAR_0_OUT128 output assigned to HSP_EQDC0_CAPTURE1 */
    kHSP__XBAR_0_OutputHspEqdc0Capture2 = 129|0x20000U, /**< HSP_XBAR_0_OUT129 output assigned to HSP_EQDC0_CAPTURE2 */
    kHSP__XBAR_0_OutputHspEqdc0Capture3 = 130|0x20000U, /**< HSP_XBAR_0_OUT130 output assigned to HSP_EQDC0_CAPTURE3 */
    kHSP__XBAR_0_OutputHspEqdc1PhaseAIn = 131|0x20000U, /**< HSP_XBAR_0_OUT131 output assigned to HSP_EQDC1_PHASE_A_IN */
    kHSP__XBAR_0_OutputHspEqdc1PhaseBIn = 132|0x20000U, /**< HSP_XBAR_0_OUT132 output assigned to HSP_EQDC1_PHASE_B_IN */
    kHSP__XBAR_0_OutputHspEqdc1IndexIn = 133|0x20000U, /**< HSP_XBAR_0_OUT133 output assigned to HSP_EQDC1_INDEX_IN */
    kHSP__XBAR_0_OutputHspEqdc1HomeIn = 134|0x20000U, /**< HSP_XBAR_0_OUT134 output assigned to HSP_EQDC1_HOME_IN */
    kHSP__XBAR_0_OutputHspEqdc1TrigIn = 135|0x20000U, /**< HSP_XBAR_0_OUT135 output assigned to HSP_EQDC1_TRIG_IN */
    kHSP__XBAR_0_OutputHspEqdc1Capture1 = 136|0x20000U, /**< HSP_XBAR_0_OUT136 output assigned to HSP_EQDC1_CAPTURE1 */
    kHSP__XBAR_0_OutputHspEqdc1Capture2 = 137|0x20000U, /**< HSP_XBAR_0_OUT137 output assigned to HSP_EQDC1_CAPTURE2 */
    kHSP__XBAR_0_OutputHspEqdc1Capture3 = 138|0x20000U, /**< HSP_XBAR_0_OUT138 output assigned to HSP_EQDC1_CAPTURE3 */
    kHSP__XBAR_0_OutputHspEqdc2PhaseAIn = 139|0x20000U, /**< HSP_XBAR_0_OUT139 output assigned to HSP_EQDC2_PHASE_A_IN */
    kHSP__XBAR_0_OutputHspEqdc2PhaseBIn = 140|0x20000U, /**< HSP_XBAR_0_OUT140 output assigned to HSP_EQDC2_PHASE_B_IN */
    kHSP__XBAR_0_OutputHspEqdc2IndexIn = 141|0x20000U, /**< HSP_XBAR_0_OUT141 output assigned to HSP_EQDC2_INDEX_IN */
    kHSP__XBAR_0_OutputHspEqdc2HomeIn = 142|0x20000U, /**< HSP_XBAR_0_OUT142 output assigned to HSP_EQDC2_HOME_IN */
    kHSP__XBAR_0_OutputHspEqdc2TrigIn = 143|0x20000U, /**< HSP_XBAR_0_OUT143 output assigned to HSP_EQDC2_TRIG_IN */
    kHSP__XBAR_0_OutputHspEqdc2Capture1 = 144|0x20000U, /**< HSP_XBAR_0_OUT144 output assigned to HSP_EQDC2_CAPTURE1 */
    kHSP__XBAR_0_OutputHspEqdc2Capture2 = 145|0x20000U, /**< HSP_XBAR_0_OUT145 output assigned to HSP_EQDC2_CAPTURE2 */
    kHSP__XBAR_0_OutputHspEqdc2Capture3 = 146|0x20000U, /**< HSP_XBAR_0_OUT146 output assigned to HSP_EQDC2_CAPTURE3 */
    kHSP__XBAR_0_OutputHspEqdc3PhaseAIn = 147|0x20000U, /**< HSP_XBAR_0_OUT147 output assigned to HSP_EQDC3_PHASE_A_IN */
    kHSP__XBAR_0_OutputHspEqdc3PhaseBIn = 148|0x20000U, /**< HSP_XBAR_0_OUT148 output assigned to HSP_EQDC3_PHASE_B_IN */
    kHSP__XBAR_0_OutputHspEqdc3IndexIn = 149|0x20000U, /**< HSP_XBAR_0_OUT149 output assigned to HSP_EQDC3_INDEX_IN */
    kHSP__XBAR_0_OutputHspEqdc3HomeIn = 150|0x20000U, /**< HSP_XBAR_0_OUT150 output assigned to HSP_EQDC3_HOME_IN */
    kHSP__XBAR_0_OutputHspEqdc3TrigIn = 151|0x20000U, /**< HSP_XBAR_0_OUT151 output assigned to HSP_EQDC3_TRIG_IN */
    kHSP__XBAR_0_OutputHspEqdc3Capture1 = 152|0x20000U, /**< HSP_XBAR_0_OUT152 output assigned to HSP_EQDC3_CAPTURE1 */
    kHSP__XBAR_0_OutputHspEqdc3Capture2 = 153|0x20000U, /**< HSP_XBAR_0_OUT153 output assigned to HSP_EQDC3_CAPTURE2 */
    kHSP__XBAR_0_OutputHspEqdc3Capture3 = 154|0x20000U, /**< HSP_XBAR_0_OUT154 output assigned to HSP_EQDC3_CAPTURE3 */
    kHSP__XBAR_0_OutputHspSinc0TrigIn0 = 155|0x20000U, /**< HSP_XBAR_0_OUT155 output assigned to HSP_SINC0_TRIG_IN0 */
    kHSP__XBAR_0_OutputHspSinc0TrigIn1 = 156|0x20000U, /**< HSP_XBAR_0_OUT156 output assigned to HSP_SINC0_TRIG_IN1 */
    kHSP__XBAR_0_OutputHspSinc0TrigIn2 = 157|0x20000U, /**< HSP_XBAR_0_OUT157 output assigned to HSP_SINC0_TRIG_IN2 */
    kHSP__XBAR_0_OutputHspSinc0TrigIn3 = 158|0x20000U, /**< HSP_XBAR_0_OUT158 output assigned to HSP_SINC0_TRIG_IN3 */
    kHSP__XBAR_0_OutputHspSinc1TrigIn0 = 159|0x20000U, /**< HSP_XBAR_0_OUT159 output assigned to HSP_SINC1_TRIG_IN0 */
    kHSP__XBAR_0_OutputHspSinc1TrigIn1 = 160|0x20000U, /**< HSP_XBAR_0_OUT160 output assigned to HSP_SINC1_TRIG_IN1 */
    kHSP__XBAR_0_OutputHspSinc1TrigIn2 = 161|0x20000U, /**< HSP_XBAR_0_OUT161 output assigned to HSP_SINC1_TRIG_IN2 */
    kHSP__XBAR_0_OutputHspSinc1TrigIn3 = 162|0x20000U, /**< HSP_XBAR_0_OUT162 output assigned to HSP_SINC1_TRIG_IN3 */
    kHSP__XBAR_0_OutputHspSinc01ModIn0 = 163|0x20000U, /**< HSP_XBAR_0_OUT163 output assigned to HSP_SINC0_1_MOD_IN0 */
    kHSP__XBAR_0_OutputHspSinc01ModIn1 = 164|0x20000U, /**< HSP_XBAR_0_OUT164 output assigned to HSP_SINC0_1_MOD_IN1 */
    kHSP__XBAR_0_OutputHspSinc01ModIn2 = 165|0x20000U, /**< HSP_XBAR_0_OUT165 output assigned to HSP_SINC0_1_MOD_IN2 */
    kHSP__XBAR_0_OutputHspSinc01ModIn3 = 166|0x20000U, /**< HSP_XBAR_0_OUT166 output assigned to HSP_SINC0_1_MOD_IN3 */
    kHSP__XBAR_0_OutputHspFlexcan0TimeTick = 167|0x20000U, /**< HSP_XBAR_0_OUT167 output assigned to HSP_FLEXCAN0_TIME_TICK */
    kHSP__XBAR_0_OutputHspFlexcan1TimeTick = 168|0x20000U, /**< HSP_XBAR_0_OUT168 output assigned to HSP_FLEXCAN1_TIME_TICK */
    kHSP__XBAR_0_OutputHspFlexcan2TimeTick = 169|0x20000U, /**< HSP_XBAR_0_OUT169 output assigned to HSP_FLEXCAN2_TIME_TICK */
    kHSP__XBAR_0_OutputHspFlexio0TrigIn0 = 170|0x20000U, /**< HSP_XBAR_0_OUT170 output assigned to HSP_FLEXIO0_TRIG_IN0 */
    kHSP__XBAR_0_OutputHspFlexio0TrigIn1 = 171|0x20000U, /**< HSP_XBAR_0_OUT171 output assigned to HSP_FLEXIO0_TRIG_IN1 */
    kHSP__XBAR_0_OutputHspFlexio0TrigIn2 = 172|0x20000U, /**< HSP_XBAR_0_OUT172 output assigned to HSP_FLEXIO0_TRIG_IN2 */
    kHSP__XBAR_0_OutputHspFlexio0TrigIn3 = 173|0x20000U, /**< HSP_XBAR_0_OUT173 output assigned to HSP_FLEXIO0_TRIG_IN3 */
    kHSP__XBAR_0_OutputHspFlexio1TrigIn0 = 174|0x20000U, /**< HSP_XBAR_0_OUT174 output assigned to HSP_FLEXIO1_TRIG_IN0 */
    kHSP__XBAR_0_OutputHspFlexio1TrigIn1 = 175|0x20000U, /**< HSP_XBAR_0_OUT175 output assigned to HSP_FLEXIO1_TRIG_IN1 */
    kHSP__XBAR_0_OutputHspFlexio1TrigIn2 = 176|0x20000U, /**< HSP_XBAR_0_OUT176 output assigned to HSP_FLEXIO1_TRIG_IN2 */
    kHSP__XBAR_0_OutputHspFlexio1TrigIn3 = 177|0x20000U, /**< HSP_XBAR_0_OUT177 output assigned to HSP_FLEXIO1_TRIG_IN3 */
    kHSP__XBAR_0_OutputHspFlexio2TrigIn0 = 178|0x20000U, /**< HSP_XBAR_0_OUT178 output assigned to HSP_FLEXIO2_TRIG_IN0 */
    kHSP__XBAR_0_OutputHspFlexio2TrigIn1 = 179|0x20000U, /**< HSP_XBAR_0_OUT179 output assigned to HSP_FLEXIO2_TRIG_IN1 */
    kHSP__XBAR_0_OutputHspFlexio2TrigIn2 = 180|0x20000U, /**< HSP_XBAR_0_OUT180 output assigned to HSP_FLEXIO2_TRIG_IN2 */
    kHSP__XBAR_0_OutputHspFlexio2TrigIn3 = 181|0x20000U, /**< HSP_XBAR_0_OUT181 output assigned to HSP_FLEXIO2_TRIG_IN3 */
    kHSP__XBAR_0_OutputHspLpi2c0TrigIn = 182|0x20000U, /**< HSP_XBAR_0_OUT182 output assigned to HSP_LPI2C0_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpi2c1TrigIn = 183|0x20000U, /**< HSP_XBAR_0_OUT183 output assigned to HSP_LPI2C1_TRIG_IN */
    kHSP__XBAR_0_OutputRESERVED184  = 184|0x20000U, /**< HSP_XBAR_0_OUT184 output is reserved. */
    kHSP__XBAR_0_OutputRESERVED185  = 185|0x20000U, /**< HSP_XBAR_0_OUT185 output is reserved. */
    kHSP__XBAR_0_OutputHspLpspi0TrigIn = 186|0x20000U, /**< HSP_XBAR_0_OUT186 output assigned to HSP_LPSPI0_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpspi1TrigIn = 187|0x20000U, /**< HSP_XBAR_0_OUT187 output assigned to HSP_LPSPI1_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpspi2TrigIn = 188|0x20000U, /**< HSP_XBAR_0_OUT188 output assigned to HSP_LPSPI2_TRIG_IN */
    kHSP__XBAR_0_OutputHspLpspi3TrigIn = 189|0x20000U, /**< HSP_XBAR_0_OUT189 output assigned to HSP_LPSPI3_TRIG_IN */
