zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/MIMXRT2663_COMMON.h
/* DMA5 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MAIN__EDMA5 base address */
  #define MAIN__EDMA5_BASE                         (0x50300000u)
  /** Peripheral MAIN__EDMA5 base address */
  #define MAIN__EDMA5_BASE_NS                      (0x40300000u)
  /** Peripheral MAIN__EDMA5 base pointer */
  #define MAIN__EDMA5                              ((DMA5_Type *)MAIN__EDMA5_BASE)
  /** Peripheral MAIN__EDMA5 base pointer */
  #define MAIN__EDMA5_NS                           ((DMA5_Type *)MAIN__EDMA5_BASE_NS)
  /** Array initializer of DMA5 peripheral base addresses */
  #define DMA5_BASE_ADDRS                          { MAIN__EDMA5_BASE }
  /** Array initializer of DMA5 peripheral base pointers */
  #define DMA5_BASE_PTRS                           { MAIN__EDMA5 }
  /** Array initializer of DMA5 peripheral base addresses */
  #define DMA5_BASE_ADDRS_NS                       { MAIN__EDMA5_BASE_NS }
  /** Array initializer of DMA5 peripheral base pointers */
  #define DMA5_BASE_PTRS_NS                        { MAIN__EDMA5_NS }
#else
  /** Peripheral MAIN__EDMA5 base address */
  #define MAIN__EDMA5_BASE                         (0x40300000u)
  /** Peripheral MAIN__EDMA5 base pointer */
  #define MAIN__EDMA5                              ((DMA5_Type *)MAIN__EDMA5_BASE)
  /** Array initializer of DMA5 peripheral base addresses */
  #define DMA5_BASE_ADDRS                          { MAIN__EDMA5_BASE }
  /** Array initializer of DMA5 peripheral base pointers */
  #define DMA5_BASE_PTRS                           { MAIN__EDMA5 }
#endif
/** Interrupt vectors for the DMA5 peripheral type */
#define DMA5_IRQS                                { { MAIN_EDMA5_CH0_IRQn, MAIN_EDMA5_CH1_IRQn, MAIN_EDMA5_CH2_IRQn, MAIN_EDMA5_CH3_IRQn, MAIN_EDMA5_CH4_IRQn, MAIN_EDMA5_CH5_IRQn, MAIN_EDMA5_CH6_IRQn, MAIN_EDMA5_CH7_IRQn, MAIN_EDMA5_CH8_IRQn, MAIN_EDMA5_CH9_IRQn, MAIN_EDMA5_CH10_IRQn, MAIN_EDMA5_CH11_IRQn, MAIN_EDMA5_CH12_IRQn, MAIN_EDMA5_CH13_IRQn, MAIN_EDMA5_CH14_IRQn, MAIN_EDMA5_CH15_IRQn } }

/* DSI2_HOST - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral DSI2_HOST base address */
  #define DSI2_HOST_BASE                           (0x5C0A0000u)
  /** Peripheral DSI2_HOST base address */
  #define DSI2_HOST_BASE_NS                        (0x4C0A0000u)
  /** Peripheral DSI2_HOST base pointer */
  #define DSI2_HOST                                ((DSI2_HOST_Type *)DSI2_HOST_BASE)
  /** Peripheral DSI2_HOST base pointer */
  #define DSI2_HOST_NS                             ((DSI2_HOST_Type *)DSI2_HOST_BASE_NS)
  /** Array initializer of DSI2_HOST peripheral base addresses */
  #define DSI2_HOST_BASE_ADDRS                     { DSI2_HOST_BASE }
  /** Array initializer of DSI2_HOST peripheral base pointers */
  #define DSI2_HOST_BASE_PTRS                      { DSI2_HOST }
  /** Array initializer of DSI2_HOST peripheral base addresses */
  #define DSI2_HOST_BASE_ADDRS_NS                  { DSI2_HOST_BASE_NS }
  /** Array initializer of DSI2_HOST peripheral base pointers */
  #define DSI2_HOST_BASE_PTRS_NS                   { DSI2_HOST_NS }
#else
  /** Peripheral DSI2_HOST base address */
  #define DSI2_HOST_BASE                           (0x4C0A0000u)
  /** Peripheral DSI2_HOST base pointer */
  #define DSI2_HOST                                ((DSI2_HOST_Type *)DSI2_HOST_BASE)
  /** Array initializer of DSI2_HOST peripheral base addresses */
  #define DSI2_HOST_BASE_ADDRS                     { DSI2_HOST_BASE }
  /** Array initializer of DSI2_HOST peripheral base pointers */
  #define DSI2_HOST_BASE_PTRS                      { DSI2_HOST }
#endif
/** Interrupt vectors for the DSI2_HOST peripheral type */
#define DSI2_HOST_IRQS                           { MEDIA_MIPI_DSI_IRQn }

/* DSI2_HOST_APB_PKT_IF - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral DSI2_HOST_APB_PKT_IF base address */
  #define DSI2_HOST_APB_PKT_IF_BASE                (0x5C0A0180u)
  /** Peripheral DSI2_HOST_APB_PKT_IF base address */
  #define DSI2_HOST_APB_PKT_IF_BASE_NS             (0x4C0A0180u)
  /** Peripheral DSI2_HOST_APB_PKT_IF base pointer */
  #define DSI2_HOST_APB_PKT_IF                     ((DSI2_HOST_APB_PKT_IF_Type *)DSI2_HOST_APB_PKT_IF_BASE)
  /** Peripheral DSI2_HOST_APB_PKT_IF base pointer */
  #define DSI2_HOST_APB_PKT_IF_NS                  ((DSI2_HOST_APB_PKT_IF_Type *)DSI2_HOST_APB_PKT_IF_BASE_NS)
  /** Array initializer of DSI2_HOST_APB_PKT_IF peripheral base addresses */
  #define DSI2_HOST_APB_PKT_IF_BASE_ADDRS          { DSI2_HOST_APB_PKT_IF_BASE }
  /** Array initializer of DSI2_HOST_APB_PKT_IF peripheral base pointers */
  #define DSI2_HOST_APB_PKT_IF_BASE_PTRS           { DSI2_HOST_APB_PKT_IF }
  /** Array initializer of DSI2_HOST_APB_PKT_IF peripheral base addresses */
  #define DSI2_HOST_APB_PKT_IF_BASE_ADDRS_NS       { DSI2_HOST_APB_PKT_IF_BASE_NS }
  /** Array initializer of DSI2_HOST_APB_PKT_IF peripheral base pointers */
  #define DSI2_HOST_APB_PKT_IF_BASE_PTRS_NS        { DSI2_HOST_APB_PKT_IF_NS }
#else
  /** Peripheral DSI2_HOST_APB_PKT_IF base address */
  #define DSI2_HOST_APB_PKT_IF_BASE                (0x4C0A0180u)
  /** Peripheral DSI2_HOST_APB_PKT_IF base pointer */
  #define DSI2_HOST_APB_PKT_IF                     ((DSI2_HOST_APB_PKT_IF_Type *)DSI2_HOST_APB_PKT_IF_BASE)
  /** Array initializer of DSI2_HOST_APB_PKT_IF peripheral base addresses */
  #define DSI2_HOST_APB_PKT_IF_BASE_ADDRS          { DSI2_HOST_APB_PKT_IF_BASE }
  /** Array initializer of DSI2_HOST_APB_PKT_IF peripheral base pointers */
  #define DSI2_HOST_APB_PKT_IF_BASE_PTRS           { DSI2_HOST_APB_PKT_IF }
#endif

/* DSI2_HOST_DBI_IF - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral DSI2_HOST_DBI_IF base address */
  #define DSI2_HOST_DBI_IF_BASE                    (0x5C0A0200u)
  /** Peripheral DSI2_HOST_DBI_IF base address */
  #define DSI2_HOST_DBI_IF_BASE_NS                 (0x4C0A0200u)
  /** Peripheral DSI2_HOST_DBI_IF base pointer */
  #define DSI2_HOST_DBI_IF                         ((DSI2_HOST_DBI_IF_Type *)DSI2_HOST_DBI_IF_BASE)
  /** Peripheral DSI2_HOST_DBI_IF base pointer */
  #define DSI2_HOST_DBI_IF_NS                      ((DSI2_HOST_DBI_IF_Type *)DSI2_HOST_DBI_IF_BASE_NS)
  /** Array initializer of DSI2_HOST_DBI_IF peripheral base addresses */
  #define DSI2_HOST_DBI_IF_BASE_ADDRS              { DSI2_HOST_DBI_IF_BASE }
  /** Array initializer of DSI2_HOST_DBI_IF peripheral base pointers */
  #define DSI2_HOST_DBI_IF_BASE_PTRS               { DSI2_HOST_DBI_IF }
  /** Array initializer of DSI2_HOST_DBI_IF peripheral base addresses */
  #define DSI2_HOST_DBI_IF_BASE_ADDRS_NS           { DSI2_HOST_DBI_IF_BASE_NS }
  /** Array initializer of DSI2_HOST_DBI_IF peripheral base pointers */
  #define DSI2_HOST_DBI_IF_BASE_PTRS_NS            { DSI2_HOST_DBI_IF_NS }
#else
  /** Peripheral DSI2_HOST_DBI_IF base address */
  #define DSI2_HOST_DBI_IF_BASE                    (0x4C0A0200u)
  /** Peripheral DSI2_HOST_DBI_IF base pointer */
  #define DSI2_HOST_DBI_IF                         ((DSI2_HOST_DBI_IF_Type *)DSI2_HOST_DBI_IF_BASE)
  /** Array initializer of DSI2_HOST_DBI_IF peripheral base addresses */
  #define DSI2_HOST_DBI_IF_BASE_ADDRS              { DSI2_HOST_DBI_IF_BASE }
  /** Array initializer of DSI2_HOST_DBI_IF peripheral base pointers */
  #define DSI2_HOST_DBI_IF_BASE_PTRS               { DSI2_HOST_DBI_IF }
#endif

