zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/MIMXRT2663_COMMON.h
/* GPIO - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__GPIO_0 base address */
  #define HSP__GPIO_0_BASE                         (0x53800000u)
  /** Peripheral HSP__GPIO_0 base address */
  #define HSP__GPIO_0_BASE_NS                      (0x43800000u)
  /** Peripheral HSP__GPIO_0 base pointer */
  #define HSP__GPIO_0                              ((GPIO_Type *)HSP__GPIO_0_BASE)
  /** Peripheral HSP__GPIO_0 base pointer */
  #define HSP__GPIO_0_NS                           ((GPIO_Type *)HSP__GPIO_0_BASE_NS)
  /** Peripheral HSP__GPIO_1 base address */
  #define HSP__GPIO_1_BASE                         (0x53810000u)
  /** Peripheral HSP__GPIO_1 base address */
  #define HSP__GPIO_1_BASE_NS                      (0x43810000u)
  /** Peripheral HSP__GPIO_1 base pointer */
  #define HSP__GPIO_1                              ((GPIO_Type *)HSP__GPIO_1_BASE)
  /** Peripheral HSP__GPIO_1 base pointer */
  #define HSP__GPIO_1_NS                           ((GPIO_Type *)HSP__GPIO_1_BASE_NS)
  /** Peripheral HSP__GPIO_2 base address */
  #define HSP__GPIO_2_BASE                         (0x53820000u)
  /** Peripheral HSP__GPIO_2 base address */
  #define HSP__GPIO_2_BASE_NS                      (0x43820000u)
  /** Peripheral HSP__GPIO_2 base pointer */
  #define HSP__GPIO_2                              ((GPIO_Type *)HSP__GPIO_2_BASE)
  /** Peripheral HSP__GPIO_2 base pointer */
  #define HSP__GPIO_2_NS                           ((GPIO_Type *)HSP__GPIO_2_BASE_NS)
  /** Peripheral HSP__GPIO_3 base address */
  #define HSP__GPIO_3_BASE                         (0x53830000u)
  /** Peripheral HSP__GPIO_3 base address */
  #define HSP__GPIO_3_BASE_NS                      (0x43830000u)
  /** Peripheral HSP__GPIO_3 base pointer */
  #define HSP__GPIO_3                              ((GPIO_Type *)HSP__GPIO_3_BASE)
  /** Peripheral HSP__GPIO_3 base pointer */
  #define HSP__GPIO_3_NS                           ((GPIO_Type *)HSP__GPIO_3_BASE_NS)
  /** Peripheral HSP__GPIO_4 base address */
  #define HSP__GPIO_4_BASE                         (0x53840000u)
  /** Peripheral HSP__GPIO_4 base address */
  #define HSP__GPIO_4_BASE_NS                      (0x43840000u)
  /** Peripheral HSP__GPIO_4 base pointer */
  #define HSP__GPIO_4                              ((GPIO_Type *)HSP__GPIO_4_BASE)
  /** Peripheral HSP__GPIO_4 base pointer */
  #define HSP__GPIO_4_NS                           ((GPIO_Type *)HSP__GPIO_4_BASE_NS)
  /** Peripheral VBAT__GPIO base address */
  #define VBAT__GPIO_BASE                          (0x56350000u)
  /** Peripheral VBAT__GPIO base address */
  #define VBAT__GPIO_BASE_NS                       (0x46350000u)
  /** Peripheral VBAT__GPIO base pointer */
  #define VBAT__GPIO                               ((GPIO_Type *)VBAT__GPIO_BASE)
  /** Peripheral VBAT__GPIO base pointer */
  #define VBAT__GPIO_NS                            ((GPIO_Type *)VBAT__GPIO_BASE_NS)
  /** Peripheral WAKE__GPIO base address */
  #define WAKE__GPIO_BASE                          (0x56210000u)
  /** Peripheral WAKE__GPIO base address */
  #define WAKE__GPIO_BASE_NS                       (0x46210000u)
  /** Peripheral WAKE__GPIO base pointer */
  #define WAKE__GPIO                               ((GPIO_Type *)WAKE__GPIO_BASE)
  /** Peripheral WAKE__GPIO base pointer */
  #define WAKE__GPIO_NS                            ((GPIO_Type *)WAKE__GPIO_BASE_NS)
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS                          { HSP__GPIO_0_BASE, HSP__GPIO_1_BASE, HSP__GPIO_2_BASE, HSP__GPIO_3_BASE, HSP__GPIO_4_BASE, VBAT__GPIO_BASE, WAKE__GPIO_BASE }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS                           { HSP__GPIO_0, HSP__GPIO_1, HSP__GPIO_2, HSP__GPIO_3, HSP__GPIO_4, VBAT__GPIO, WAKE__GPIO }
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS_NS                       { HSP__GPIO_0_BASE_NS, HSP__GPIO_1_BASE_NS, HSP__GPIO_2_BASE_NS, HSP__GPIO_3_BASE_NS, HSP__GPIO_4_BASE_NS, VBAT__GPIO_BASE_NS, WAKE__GPIO_BASE_NS }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS_NS                        { HSP__GPIO_0_NS, HSP__GPIO_1_NS, HSP__GPIO_2_NS, HSP__GPIO_3_NS, HSP__GPIO_4_NS, VBAT__GPIO_NS, WAKE__GPIO_NS }
#else
  /** Peripheral HSP__GPIO_0 base address */
  #define HSP__GPIO_0_BASE                         (0x43800000u)
  /** Peripheral HSP__GPIO_0 base pointer */
  #define HSP__GPIO_0                              ((GPIO_Type *)HSP__GPIO_0_BASE)
  /** Peripheral HSP__GPIO_1 base address */
  #define HSP__GPIO_1_BASE                         (0x43810000u)
  /** Peripheral HSP__GPIO_1 base pointer */
  #define HSP__GPIO_1                              ((GPIO_Type *)HSP__GPIO_1_BASE)
  /** Peripheral HSP__GPIO_2 base address */
  #define HSP__GPIO_2_BASE                         (0x43820000u)
  /** Peripheral HSP__GPIO_2 base pointer */
  #define HSP__GPIO_2                              ((GPIO_Type *)HSP__GPIO_2_BASE)
  /** Peripheral HSP__GPIO_3 base address */
  #define HSP__GPIO_3_BASE                         (0x43830000u)
  /** Peripheral HSP__GPIO_3 base pointer */
  #define HSP__GPIO_3                              ((GPIO_Type *)HSP__GPIO_3_BASE)
  /** Peripheral HSP__GPIO_4 base address */
  #define HSP__GPIO_4_BASE                         (0x43840000u)
  /** Peripheral HSP__GPIO_4 base pointer */
  #define HSP__GPIO_4                              ((GPIO_Type *)HSP__GPIO_4_BASE)
  /** Peripheral VBAT__GPIO base address */
  #define VBAT__GPIO_BASE                          (0x46350000u)
  /** Peripheral VBAT__GPIO base pointer */
  #define VBAT__GPIO                               ((GPIO_Type *)VBAT__GPIO_BASE)
  /** Peripheral WAKE__GPIO base address */
  #define WAKE__GPIO_BASE                          (0x46210000u)
  /** Peripheral WAKE__GPIO base pointer */
  #define WAKE__GPIO                               ((GPIO_Type *)WAKE__GPIO_BASE)
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS                          { HSP__GPIO_0_BASE, HSP__GPIO_1_BASE, HSP__GPIO_2_BASE, HSP__GPIO_3_BASE, HSP__GPIO_4_BASE, VBAT__GPIO_BASE, WAKE__GPIO_BASE }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS                           { HSP__GPIO_0, HSP__GPIO_1, HSP__GPIO_2, HSP__GPIO_3, HSP__GPIO_4, VBAT__GPIO, WAKE__GPIO }
#endif
/** Interrupt vectors for the GPIO peripheral type */
#define GPIO_IRQS                                { HSP_GPIO0_CH0_IRQn, HSP_GPIO1_CH0_IRQn, HSP_GPIO2_CH0_IRQn, HSP_GPIO3_CH0_IRQn, HSP_GPIO4_CH0_IRQn, VBAT_GPIO_CH0_IRQn, WAKE_GPIO_CH0_IRQn }
#define GPIO_1_IRQS                              { HSP_GPIO0_CH1_IRQn, HSP_GPIO1_CH1_IRQn, HSP_GPIO2_CH1_IRQn, HSP_GPIO3_CH1_IRQn, HSP_GPIO4_CH1_IRQn, VBAT_GPIO_CH1_IRQn, WAKE_GPIO_CH1_IRQn }
/* Backward compatibility */
#define GPIO_IRQS_1                              GPIO_1_IRQS


/* I2S - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__SAI_0 base address */
  #define AUDIO__SAI_0_BASE                        (0x580C0000u)
  /** Peripheral AUDIO__SAI_0 base address */
  #define AUDIO__SAI_0_BASE_NS                     (0x480C0000u)
  /** Peripheral AUDIO__SAI_0 base pointer */
  #define AUDIO__SAI_0                             ((I2S_Type *)AUDIO__SAI_0_BASE)
  /** Peripheral AUDIO__SAI_0 base pointer */
  #define AUDIO__SAI_0_NS                          ((I2S_Type *)AUDIO__SAI_0_BASE_NS)
  /** Peripheral AUDIO__SAI_1 base address */
  #define AUDIO__SAI_1_BASE                        (0x580D0000u)
  /** Peripheral AUDIO__SAI_1 base address */
  #define AUDIO__SAI_1_BASE_NS                     (0x480D0000u)
  /** Peripheral AUDIO__SAI_1 base pointer */
  #define AUDIO__SAI_1                             ((I2S_Type *)AUDIO__SAI_1_BASE)
  /** Peripheral AUDIO__SAI_1 base pointer */
  #define AUDIO__SAI_1_NS                          ((I2S_Type *)AUDIO__SAI_1_BASE_NS)
  /** Peripheral AUDIO__SAI_2 base address */
  #define AUDIO__SAI_2_BASE                        (0x580E0000u)
  /** Peripheral AUDIO__SAI_2 base address */
  #define AUDIO__SAI_2_BASE_NS                     (0x480E0000u)
  /** Peripheral AUDIO__SAI_2 base pointer */
  #define AUDIO__SAI_2                             ((I2S_Type *)AUDIO__SAI_2_BASE)
  /** Peripheral AUDIO__SAI_2 base pointer */
  #define AUDIO__SAI_2_NS                          ((I2S_Type *)AUDIO__SAI_2_BASE_NS)
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS                           { AUDIO__SAI_0_BASE, AUDIO__SAI_1_BASE, AUDIO__SAI_2_BASE }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS                            { AUDIO__SAI_0, AUDIO__SAI_1, AUDIO__SAI_2 }
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS_NS                        { AUDIO__SAI_0_BASE_NS, AUDIO__SAI_1_BASE_NS, AUDIO__SAI_2_BASE_NS }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS_NS                         { AUDIO__SAI_0_NS, AUDIO__SAI_1_NS, AUDIO__SAI_2_NS }
#else
  /** Peripheral AUDIO__SAI_0 base address */
  #define AUDIO__SAI_0_BASE                        (0x480C0000u)
  /** Peripheral AUDIO__SAI_0 base pointer */
  #define AUDIO__SAI_0                             ((I2S_Type *)AUDIO__SAI_0_BASE)
  /** Peripheral AUDIO__SAI_1 base address */
  #define AUDIO__SAI_1_BASE                        (0x480D0000u)
  /** Peripheral AUDIO__SAI_1 base pointer */
  #define AUDIO__SAI_1                             ((I2S_Type *)AUDIO__SAI_1_BASE)
  /** Peripheral AUDIO__SAI_2 base address */
  #define AUDIO__SAI_2_BASE                        (0x480E0000u)
  /** Peripheral AUDIO__SAI_2 base pointer */
  #define AUDIO__SAI_2                             ((I2S_Type *)AUDIO__SAI_2_BASE)
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS                           { AUDIO__SAI_0_BASE, AUDIO__SAI_1_BASE, AUDIO__SAI_2_BASE }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS                            { AUDIO__SAI_0, AUDIO__SAI_1, AUDIO__SAI_2 }
#endif
/** Interrupt vectors for the I2S peripheral type */
#define I2S_RX_IRQS                              { AUDIO_SAI0_IRQn, AUDIO_SAI1_IRQn, AUDIO_SAI2_IRQn }
#define I2S_TX_IRQS                              { AUDIO_SAI0_IRQn, AUDIO_SAI1_IRQn, AUDIO_SAI2_IRQn }

/* I3C - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral HSP__I3C base address */
  #define HSP__I3C_BASE                            (0x52130000u)
  /** Peripheral HSP__I3C base address */
  #define HSP__I3C_BASE_NS                         (0x42130000u)
  /** Peripheral HSP__I3C base pointer */
  #define HSP__I3C                                 ((I3C_Type *)HSP__I3C_BASE)
  /** Peripheral HSP__I3C base pointer */
  #define HSP__I3C_NS                              ((I3C_Type *)HSP__I3C_BASE_NS)
  /** Peripheral WAKE__I3C base address */
  #define WAKE__I3C_BASE                           (0x561B0000u)
  /** Peripheral WAKE__I3C base address */
  #define WAKE__I3C_BASE_NS                        (0x461B0000u)
  /** Peripheral WAKE__I3C base pointer */
  #define WAKE__I3C                                ((I3C_Type *)WAKE__I3C_BASE)
  /** Peripheral WAKE__I3C base pointer */
  #define WAKE__I3C_NS                             ((I3C_Type *)WAKE__I3C_BASE_NS)
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS                           { HSP__I3C_BASE, WAKE__I3C_BASE }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS                            { HSP__I3C, WAKE__I3C }
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS_NS                        { HSP__I3C_BASE_NS, WAKE__I3C_BASE_NS }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS_NS                         { HSP__I3C_NS, WAKE__I3C_NS }
#else
  /** Peripheral HSP__I3C base address */
  #define HSP__I3C_BASE                            (0x42130000u)
  /** Peripheral HSP__I3C base pointer */
  #define HSP__I3C                                 ((I3C_Type *)HSP__I3C_BASE)
  /** Peripheral WAKE__I3C base address */
  #define WAKE__I3C_BASE                           (0x461B0000u)
  /** Peripheral WAKE__I3C base pointer */
  #define WAKE__I3C                                ((I3C_Type *)WAKE__I3C_BASE)
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS                           { HSP__I3C_BASE, WAKE__I3C_BASE }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS                            { HSP__I3C, WAKE__I3C }
#endif
/** Interrupt vectors for the I3C peripheral type */
#define I3C_IRQS                                 { HSP_I3C_IRQn, WAKE_I3C_IRQn }

/* INPUTMUX - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AUDIO__INPUTMUX base address */
  #define AUDIO__INPUTMUX_BASE                     (0x580A0000u)
  /** Peripheral AUDIO__INPUTMUX base address */
  #define AUDIO__INPUTMUX_BASE_NS                  (0x480A0000u)
  /** Peripheral AUDIO__INPUTMUX base pointer */
  #define AUDIO__INPUTMUX                          ((INPUTMUX_Type *)AUDIO__INPUTMUX_BASE)
  /** Peripheral AUDIO__INPUTMUX base pointer */
  #define AUDIO__INPUTMUX_NS                       ((INPUTMUX_Type *)AUDIO__INPUTMUX_BASE_NS)
  /** Peripheral CMPT__INPUTMUX base address */
  #define CMPT__INPUTMUX_BASE                      (0x541E0000u)
  /** Peripheral CMPT__INPUTMUX base address */
  #define CMPT__INPUTMUX_BASE_NS                   (0x441E0000u)
  /** Peripheral CMPT__INPUTMUX base pointer */
  #define CMPT__INPUTMUX                           ((INPUTMUX_Type *)CMPT__INPUTMUX_BASE)
  /** Peripheral CMPT__INPUTMUX base pointer */
  #define CMPT__INPUTMUX_NS                        ((INPUTMUX_Type *)CMPT__INPUTMUX_BASE_NS)
  /** Peripheral COMM__INPUTMUX base address */
  #define COMM__INPUTMUX_BASE                      (0x5A130000u)
  /** Peripheral COMM__INPUTMUX base address */
  #define COMM__INPUTMUX_BASE_NS                   (0x4A130000u)
  /** Peripheral COMM__INPUTMUX base pointer */
  #define COMM__INPUTMUX                           ((INPUTMUX_Type *)COMM__INPUTMUX_BASE)
  /** Peripheral COMM__INPUTMUX base pointer */
  #define COMM__INPUTMUX_NS                        ((INPUTMUX_Type *)COMM__INPUTMUX_BASE_NS)
  /** Peripheral MAIN__INPUTMUX base address */
  #define MAIN__INPUTMUX_BASE                      (0x50420000u)
  /** Peripheral MAIN__INPUTMUX base address */
  #define MAIN__INPUTMUX_BASE_NS                   (0x40420000u)
  /** Peripheral MAIN__INPUTMUX base pointer */
  #define MAIN__INPUTMUX                           ((INPUTMUX_Type *)MAIN__INPUTMUX_BASE)
  /** Peripheral MAIN__INPUTMUX base pointer */
  #define MAIN__INPUTMUX_NS                        ((INPUTMUX_Type *)MAIN__INPUTMUX_BASE_NS)
  /** Peripheral MEDIA__INPUTMUX base address */
  #define MEDIA__INPUTMUX_BASE                     (0x5C110000u)
  /** Peripheral MEDIA__INPUTMUX base address */
  #define MEDIA__INPUTMUX_BASE_NS                  (0x4C110000u)
  /** Peripheral MEDIA__INPUTMUX base pointer */
  #define MEDIA__INPUTMUX                          ((INPUTMUX_Type *)MEDIA__INPUTMUX_BASE)
  /** Peripheral MEDIA__INPUTMUX base pointer */
  #define MEDIA__INPUTMUX_NS                       ((INPUTMUX_Type *)MEDIA__INPUTMUX_BASE_NS)
  /** Peripheral SYSCON__INPUTMUX base address */
  #define SYSCON__INPUTMUX_BASE                    (0x505A0000u)
  /** Peripheral SYSCON__INPUTMUX base address */
  #define SYSCON__INPUTMUX_BASE_NS                 (0x405A0000u)
  /** Peripheral SYSCON__INPUTMUX base pointer */
  #define SYSCON__INPUTMUX                         ((INPUTMUX_Type *)SYSCON__INPUTMUX_BASE)
  /** Peripheral SYSCON__INPUTMUX base pointer */
  #define SYSCON__INPUTMUX_NS                      ((INPUTMUX_Type *)SYSCON__INPUTMUX_BASE_NS)
  /** Peripheral WAKE__INPUTMUX base address */
  #define WAKE__INPUTMUX_BASE                      (0x56090000u)
  /** Peripheral WAKE__INPUTMUX base address */
  #define WAKE__INPUTMUX_BASE_NS                   (0x46090000u)
  /** Peripheral WAKE__INPUTMUX base pointer */
  #define WAKE__INPUTMUX                           ((INPUTMUX_Type *)WAKE__INPUTMUX_BASE)
  /** Peripheral WAKE__INPUTMUX base pointer */
  #define WAKE__INPUTMUX_NS                        ((INPUTMUX_Type *)WAKE__INPUTMUX_BASE_NS)
  /** Array initializer of INPUTMUX peripheral base addresses */
  #define INPUTMUX_BASE_ADDRS                      { AUDIO__INPUTMUX_BASE, CMPT__INPUTMUX_BASE, COMM__INPUTMUX_BASE, MAIN__INPUTMUX_BASE, MEDIA__INPUTMUX_BASE, SYSCON__INPUTMUX_BASE, WAKE__INPUTMUX_BASE }
  /** Array initializer of INPUTMUX peripheral base pointers */
  #define INPUTMUX_BASE_PTRS                       { AUDIO__INPUTMUX, CMPT__INPUTMUX, COMM__INPUTMUX, MAIN__INPUTMUX, MEDIA__INPUTMUX, SYSCON__INPUTMUX, WAKE__INPUTMUX }
  /** Array initializer of INPUTMUX peripheral base addresses */
  #define INPUTMUX_BASE_ADDRS_NS                   { AUDIO__INPUTMUX_BASE_NS, CMPT__INPUTMUX_BASE_NS, COMM__INPUTMUX_BASE_NS, MAIN__INPUTMUX_BASE_NS, MEDIA__INPUTMUX_BASE_NS, SYSCON__INPUTMUX_BASE_NS, WAKE__INPUTMUX_BASE_NS }
  /** Array initializer of INPUTMUX peripheral base pointers */
  #define INPUTMUX_BASE_PTRS_NS                    { AUDIO__INPUTMUX_NS, CMPT__INPUTMUX_NS, COMM__INPUTMUX_NS, MAIN__INPUTMUX_NS, MEDIA__INPUTMUX_NS, SYSCON__INPUTMUX_NS, WAKE__INPUTMUX_NS }
#else
  /** Peripheral AUDIO__INPUTMUX base address */
  #define AUDIO__INPUTMUX_BASE                     (0x480A0000u)
  /** Peripheral AUDIO__INPUTMUX base pointer */
  #define AUDIO__INPUTMUX                          ((INPUTMUX_Type *)AUDIO__INPUTMUX_BASE)
  /** Peripheral CMPT__INPUTMUX base address */
  #define CMPT__INPUTMUX_BASE                      (0x441E0000u)
  /** Peripheral CMPT__INPUTMUX base pointer */
  #define CMPT__INPUTMUX                           ((INPUTMUX_Type *)CMPT__INPUTMUX_BASE)
  /** Peripheral COMM__INPUTMUX base address */
  #define COMM__INPUTMUX_BASE                      (0x4A130000u)
  /** Peripheral COMM__INPUTMUX base pointer */
  #define COMM__INPUTMUX                           ((INPUTMUX_Type *)COMM__INPUTMUX_BASE)
  /** Peripheral MAIN__INPUTMUX base address */
  #define MAIN__INPUTMUX_BASE                      (0x40420000u)
  /** Peripheral MAIN__INPUTMUX base pointer */
  #define MAIN__INPUTMUX                           ((INPUTMUX_Type *)MAIN__INPUTMUX_BASE)
  /** Peripheral MEDIA__INPUTMUX base address */
  #define MEDIA__INPUTMUX_BASE                     (0x4C110000u)
  /** Peripheral MEDIA__INPUTMUX base pointer */
  #define MEDIA__INPUTMUX                          ((INPUTMUX_Type *)MEDIA__INPUTMUX_BASE)
  /** Peripheral SYSCON__INPUTMUX base address */
  #define SYSCON__INPUTMUX_BASE                    (0x405A0000u)
  /** Peripheral SYSCON__INPUTMUX base pointer */
  #define SYSCON__INPUTMUX                         ((INPUTMUX_Type *)SYSCON__INPUTMUX_BASE)
  /** Peripheral WAKE__INPUTMUX base address */
  #define WAKE__INPUTMUX_BASE                      (0x46090000u)
  /** Peripheral WAKE__INPUTMUX base pointer */
  #define WAKE__INPUTMUX                           ((INPUTMUX_Type *)WAKE__INPUTMUX_BASE)
  /** Array initializer of INPUTMUX peripheral base addresses */
  #define INPUTMUX_BASE_ADDRS                      { AUDIO__INPUTMUX_BASE, CMPT__INPUTMUX_BASE, COMM__INPUTMUX_BASE, MAIN__INPUTMUX_BASE, MEDIA__INPUTMUX_BASE, SYSCON__INPUTMUX_BASE, WAKE__INPUTMUX_BASE }
  /** Array initializer of INPUTMUX peripheral base pointers */
  #define INPUTMUX_BASE_PTRS                       { AUDIO__INPUTMUX, CMPT__INPUTMUX, COMM__INPUTMUX, MAIN__INPUTMUX, MEDIA__INPUTMUX, SYSCON__INPUTMUX, WAKE__INPUTMUX }
#endif

